(ns app.core)
(use 'uawa.core)

(require '[clj-http.client :as client])
(require '[clojure.data.json :as json])

(функція друкуй-запити-за-ярликом
  "друкує запити з ярликом"
  [логін пароль хост ярлик]  
  (друкуй "шукаю завдання з ярликом "  ярлик " з хоста " хост)
  (постійна лінка (str "https://" хост "/rest/api/2/search?jql=labels%3D" ярлик))
  (постійна відповідь (client/get лінка {:basic-auth (str логін ":" пароль)}))
  (постійна запити  (.отримай (json/read-str (:body відповідь)) "issues"))
  (постійна номера-запитів (відобрази #(.отримай %1 "key") запити))  
  (якщо (пусто? запити) (друкуй "-- не знайдено") (друкуй номера-запитів))
)

(функція -main [логін пароль хост ярлик]
  (друкуй логін)
  (друкуй-запити-за-ярликом логін пароль хост ярлик)
)
