(ns app.core)
(use 'uawa.core)

(require '[clj-http.client :as client])
(require '[clojure.data.json :as json])

(функція друкуй-тікети-за-ярликом
  "друкує тікети з ярликом"
  [логін пароль хост ярлик]  
  (друкуй "шукаю завдання з ярликом "  ярлик " з хоста " хост)
  (постійна лінка (str "https://" хост "/rest/api/2/search?jql=labels%3D" ярлик))
  (постійна в (client/get лінка {:basic-auth (str логін ":" пароль)}))
  (постійна проблеми (відобрази #(.отримай %1 "key") (.отримай (json/read-str (:body в)) "issues")))  
  (якщо (пусто? проблеми) (друкуй "-- не знайдено") (друкуй проблеми))
)

(функція -main [логін пароль хост ярлик]
  (друкуй логін)
  (друкуй-тікети-за-ярликом логін пароль хост ярлик)
)
