;; gorilla-repl.fileformat = 1

;; **
;;; # Загальний кошт атомної зброї та енергетики для людства
;;; 
;;; http://elib.biblioatom.ru/text/atomnaya-energiya_t4-6_1958/go,78/
;;; 
;;; А.Д. Сахаров Радиоактивный углерод ядерных взрывов и непороговые биологические эффекты // Атомная энергия. Том 4, вып. 6. — 1958 - 1958 С 576..581
;;; 
;;; Andrei D. Sakharov · Radioactive Carbon from Nuclear Explosions and Nonthreshold Biological Effects Science and Global Secиrity, 1990, Volume 1, Nos. 3-4, рр. 175-187
;;; 
;;; >по нашей ориентировочной и, вероятно, заннженной оценке, потери чело­вечества от всей совокуnности непороговых биологических эффектов следует по мень­шей мере уТроить по сравнению с цифрой только для генетических nотерь, т.е. nри­нять потери равными 3·10-4 1/р. Формаль­ное суммирование всех упомянутых выше эффектов (без сющки на "неясность") nри­вело бы к цифре 6·10-4 1/р. 
;;; > ...
;;; > Таким образом, общие потери от взрыва мощностью 1 Мт составят 10 тыс.человек
;;; 
;;; Каплан Месть мирного атома 
;;; 
;;; > В своей статье, появившейся в 1958 году в английском издании советского журнала "Атомная энергия", Андрей Дмитриевич 
;;; Сахаров показал, что от радиоактивности, выделенной при взрыве водородной бомбы мощностью в одну мегатонну - от рака, генетических нарушений и других болезней умрет или тяжело пострадает около десяти тысяч человек." 
;;; 
;;; > Насколько расчеты АД. Сахарова выдержали испытания временем? Согласно его оценке, при взрыве советской водородной бомбы мощностью в 50 мегатонн, проведенном в 1961 году (что составляет около 10% от мощности всех атмосферных ядерных взрывов) должно было погибнуть или серьезно заболеть около полумиллиона человек. Так оно и случилось. Выведенная Сахаровым цифра в 10 тысяч смертных случаев и серьезных заболеваний (от непороговых биологических эффектов) на каждую мегатонну мощности ядерных взрывов в атмосфере (в течение времени, за которое распадается образованный при ядерных взрывах радиоактивный углерод-14) близка к той, которая может быть сделана на основе современной информации.
;;; 
;;; >Обобщение приведенных выше расчетов по масштабам радиационного поражения населения планеты в XX веке в результате развития атомной индустрии дает следующую общую картину [66]:
;;; 
;;; >1. Общее число жертв от ядерных испытаний равно 1 млрд. 138 млн. человек, в том числе:
;;; 
;;; >1.1. Фатальных раков - 240 млн. человек;
;;; 
;;; >1.2. Не фатальных раков -117 млн. человек;
;;; 
;;; >1.3. Генетических поражений - 223 млн. человек;
;;; 
;;; >1.4. Врожденных уродств - 558 млн. человек.
;;; 
;;; >2. Общее число жертв от производства ядерного оружия равно 3, 2 млн. человек.
;;; 
;;; >3. Общее число жертв от радиационных аварий, связанных с военным производством, (Уиндскейл, Южно-Уральская, Чернобыльская и другие) - 1 млрд. 156 млн. человек.
;;; 
;;; > 4. Общее число жертв от производства электричества на АЭС - 21 млн. человек.
;;; 
;;; > 5. Общее число жертв от аварий на АЭС - 15 млн. человек.
;;; 
;;; > 6. Общее число жертв от медицинского радиационного поражения - 4 млн. человек.
;;; 
;;; >Таким образом, общее число жертв атомного века [66] от раков, генетических поражений и врожденных уродств - 2 млрд. 337 млн. человек.
;;; 
;;; >...
;;; 
;;; >[66] - Аналитический обзор. О состоянии здоровья работников Минатома. Бюллетень Ддерной и радиационной безопасности, 1999, № 4, с. 20-21.
;;; 
;;; https://en.wikipedia.org/wiki/International_Nuclear_Event_Scale#Nuclear_Accident_Magnitude_Scale
;;; https://www.davidsmythe.org/nuclear/accidents.htm
;;; https://onlinelibrary.wiley.com/doi/pdf/10.1111/risa.12587
;; **

;; @@
(use 'uawa.core)
;; @@
;; =>
;;; {"type":"html","content":"<span class='clj-nil'>nil</span>","value":"nil"}
;; <=

;; @@
(ціна ціна-груші 100 грн)
(функція розрахуй-вартість [ціна-за-єдиницю кількість] (домнож ціна-за-єдиницю кількість))
(друкуй (розрахуй-вартість ціна-груші 10))
;; @@
;; ->
;;; 1000 UAH
;;; 
;; <-
;; =>
;;; {"type":"html","content":"<span class='clj-nil'>nil</span>","value":"nil"}
;; <=

;; @@

;; @@
